; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=59, out_folder=htg/blocksworld/training, instance_id=39, seed=2063, goal_proportion=0.1

(define (problem blocksworld-39)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 - object)
 (:init 
    (arm-empty)
    (clear b28)
    (on b28 b6)
    (on b6 b36)
    (on b36 b48)
    (on b48 b45)
    (on b45 b35)
    (on b35 b11)
    (on b11 b26)
    (on b26 b3)
    (on b3 b8)
    (on b8 b42)
    (on-table b42)
    (clear b22)
    (on b22 b2)
    (on b2 b4)
    (on-table b4)
    (clear b56)
    (on b56 b17)
    (on b17 b38)
    (on b38 b51)
    (on b51 b9)
    (on b9 b53)
    (on-table b53)
    (clear b30)
    (on b30 b43)
    (on b43 b1)
    (on-table b1)
    (clear b57)
    (on b57 b55)
    (on b55 b34)
    (on b34 b46)
    (on b46 b13)
    (on b13 b52)
    (on b52 b19)
    (on b19 b18)
    (on b18 b23)
    (on b23 b40)
    (on b40 b25)
    (on b25 b37)
    (on b37 b39)
    (on b39 b47)
    (on-table b47)
    (clear b27)
    (on b27 b31)
    (on b31 b41)
    (on b41 b50)
    (on b50 b20)
    (on b20 b29)
    (on b29 b16)
    (on b16 b58)
    (on b58 b44)
    (on b44 b21)
    (on b21 b32)
    (on b32 b14)
    (on b14 b5)
    (on b5 b15)
    (on b15 b7)
    (on b7 b49)
    (on b49 b24)
    (on b24 b59)
    (on b59 b33)
    (on b33 b12)
    (on b12 b10)
    (on b10 b54)
    (on-table b54))
 (:goal  (and 
    (clear b4)
    (on b4 b1)
    (on b1 b3)
    (on b3 b2)
    (on b2 b5)
    (on-table b5))))

; plan
1. (unstack b27 b31)
   deleted: (on b27 b31) (clear b27) (arm-empty)
   added: (holding b27) (clear b31)
   goals met: 0 of 6
2. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 0 of 6
3. (unstack b28 b6)
   deleted: (on b28 b6) (clear b28) (arm-empty)
   added: (holding b28) (clear b6)
   goals met: 0 of 6
4. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 0 of 6
5. (unstack b6 b36)
   deleted: (on b6 b36) (clear b6) (arm-empty)
   added: (holding b6) (clear b36)
   goals met: 0 of 6
6. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 0 of 6
7. (unstack b36 b48)
   deleted: (on b36 b48) (clear b36) (arm-empty)
   added: (holding b36) (clear b48)
   goals met: 0 of 6
8. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 0 of 6
9. (unstack b48 b45)
   deleted: (on b48 b45) (clear b48) (arm-empty)
   added: (holding b48) (clear b45)
   goals met: 0 of 6
10. (putdown b48)
   deleted: (holding b48)
   added: (clear b48) (arm-empty) (on-table b48)
   goals met: 0 of 6
11. (unstack b45 b35)
   deleted: (on b45 b35) (clear b45) (arm-empty)
   added: (holding b45) (clear b35)
   goals met: 0 of 6
12. (putdown b45)
   deleted: (holding b45)
   added: (clear b45) (arm-empty) (on-table b45)
   goals met: 0 of 6
13. (unstack b22 b2)
   deleted: (on b22 b2) (clear b22) (arm-empty)
   added: (holding b22) (clear b2)
   goals met: 0 of 6
14. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 0 of 6
15. (unstack b30 b43)
   deleted: (on b30 b43) (clear b30) (arm-empty)
   added: (holding b30) (clear b43)
   goals met: 0 of 6
16. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 0 of 6
17. (unstack b31 b41)
   deleted: (on b31 b41) (clear b31) (arm-empty)
   added: (holding b31) (clear b41)
   goals met: 0 of 6
18. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 0 of 6
19. (unstack b41 b50)
   deleted: (on b41 b50) (clear b41) (arm-empty)
   added: (holding b41) (clear b50)
   goals met: 0 of 6
20. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 0 of 6
21. (unstack b50 b20)
   deleted: (on b50 b20) (clear b50) (arm-empty)
   added: (holding b50) (clear b20)
   goals met: 0 of 6
22. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 0 of 6
23. (unstack b20 b29)
   deleted: (on b20 b29) (clear b20) (arm-empty)
   added: (holding b20) (clear b29)
   goals met: 0 of 6
24. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 0 of 6
25. (unstack b43 b1)
   deleted: (on b43 b1) (clear b43) (arm-empty)
   added: (holding b43) (clear b1)
   goals met: 0 of 6
26. (putdown b43)
   deleted: (holding b43)
   added: (clear b43) (arm-empty) (on-table b43)
   goals met: 0 of 6
27. (unstack b29 b16)
   deleted: (on b29 b16) (clear b29) (arm-empty)
   added: (holding b29) (clear b16)
   goals met: 0 of 6
28. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 0 of 6
29. (unstack b16 b58)
   deleted: (on b16 b58) (clear b16) (arm-empty)
   added: (holding b16) (clear b58)
   goals met: 0 of 6
30. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 0 of 6
31. (unstack b58 b44)
   deleted: (on b58 b44) (clear b58) (arm-empty)
   added: (holding b58) (clear b44)
   goals met: 0 of 6
32. (putdown b58)
   deleted: (holding b58)
   added: (clear b58) (arm-empty) (on-table b58)
   goals met: 0 of 6
33. (unstack b44 b21)
   deleted: (on b44 b21) (clear b44) (arm-empty)
   added: (holding b44) (clear b21)
   goals met: 0 of 6
34. (putdown b44)
   deleted: (holding b44)
   added: (clear b44) (arm-empty) (on-table b44)
   goals met: 0 of 6
35. (unstack b21 b32)
   deleted: (on b21 b32) (clear b21) (arm-empty)
   added: (holding b21) (clear b32)
   goals met: 0 of 6
36. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 0 of 6
37. (unstack b32 b14)
   deleted: (on b32 b14) (clear b32) (arm-empty)
   added: (holding b32) (clear b14)
   goals met: 0 of 6
38. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 0 of 6
39. (unstack b14 b5)
   deleted: (on b14 b5) (clear b14) (arm-empty)
   added: (holding b14) (clear b5)
   goals met: 0 of 6
40. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 0 of 6
41. (unstack b5 b15)
   deleted: (on b5 b15) (clear b5) (arm-empty)
   added: (holding b5) (clear b15)
   goals met: 0 of 6
42. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 6
43. (unstack b2 b4)
   deleted: (on b2 b4) (clear b2) (arm-empty)
   added: (holding b2) (clear b4)
   goals met: 2 of 6
44. (stack b2 b5)
   deleted: (clear b5) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b5)
   goals met: 3 of 6
45. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 2 of 6
46. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 4 of 6
47. (unstack b35 b11)
   deleted: (on b35 b11) (clear b35) (arm-empty)
   added: (holding b35) (clear b11)
   goals met: 4 of 6
48. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 4 of 6
49. (unstack b11 b26)
   deleted: (on b11 b26) (clear b11) (arm-empty)
   added: (holding b11) (clear b26)
   goals met: 4 of 6
50. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 4 of 6
51. (unstack b26 b3)
   deleted: (on b26 b3) (clear b26) (arm-empty)
   added: (holding b26) (clear b3)
   goals met: 4 of 6
52. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 4 of 6
53. (unstack b3 b8)
   deleted: (on b3 b8) (clear b3) (arm-empty)
   added: (holding b3) (clear b8)
   goals met: 4 of 6
54. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 5 of 6
55. (unstack b4 b1)
   deleted: (on b4 b1) (clear b4) (arm-empty)
   added: (holding b4) (clear b1)
   goals met: 3 of 6
56. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 4 of 6
57. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 4 of 6
58. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 5 of 6
59. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 4 of 6
60. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 6 of 6
